# Installation
#
# /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# brew tap homebrew/bundle
# brew tap caskroom/versions
# brew tap heroku/brew
# brew bundle

# Language manager
brew 'asdf'

# Build tools and environments
brew 'coreutils'
brew 'gpg'
brew 'cmake'
brew 'heroku/brew/heroku'
brew 'mas'
brew 'yarn'

# Network tools
brew 'wget'
brew 'whois'

# General command-line software and libraries
brew 'direnv'
brew 'forego'
brew 'git'
brew 'git-lfs'
brew 'bash-completion'
brew 'libsodium'
brew 'postgresql'
brew 'redis'
brew 'vim'

# Applications
cask 'colloquy'
# cask 'dropbox' (broken as of OS X 10.15)
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'keybase'
cask 'sizeup'
cask 'slack'
cask 'transmission'
cask 'typora'
cask 'vyprvpn'
cask 'docker'

# App Store applications
mas '1Password', id: 443987910
mas 'Double Shot', id: 1076145960
mas 'Monosnap', id: 540348655
mas 'Pixelmator', id: 407963104
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835
