# Installation
#
# /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# brew tap homebrew/bundle
# brew tap caskroom/versions
# brew bundle

brew 'ant'
brew 'cmake'
brew 'direnv'
brew 'elixir'
brew 'git'
brew 'go'
brew 'jenv'
brew 'mas'
brew 'node'
brew 'npm'
brew 'postgresql'
brew 'rbenv'
brew 'redis'
brew 'vim'
brew 'wget'
brew 'whois'

cask 'ableton-live-suite'
cask 'dropbox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'sizeup'
cask 'scenebuilder'
cask 'skype'
cask 'slack-beta'
cask 'vlc'
cask 'vyprvpn'

mas '1Password', id: 443987910
mas 'Double Shot', id: 1076145960
mas 'Keynote', id: 409183694
mas 'Monosnap', id: 540348655
mas 'Numbers', id: 409203825
mas 'OmniGraffle', id: 1142578753
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Tweetbot', id: 557168941
mas 'Wunderlist', id: 410628904
