# Installation
#
# /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# brew tap homebrew/bundle
# brew tap caskroom/versions
# brew bundle


# Languages first
brew 'elixir'
brew 'go'
brew 'gradle'
brew 'node'

cask 'java'

# Build tools and environments
brew 'ant'
brew 'cmake'
brew 'jenv'
brew 'mas'
brew 'npm'
brew 'rbenv'
brew 'yarn'

# Network tools
brew 'wget'
brew 'whois'

# General command-line software and libraries
brew 'direnv'
brew 'forego'
brew 'git'
brew 'git-lfs'
brew 'opencv'
brew 'opencv@2'
brew 'postgresql'
brew 'redis'
brew 'vim'

# Applications
cask 'ableton-live-suite'
cask 'colloquy'
cask 'dropbox'
cask 'github'
cask 'google-chrome'
cask 'iterm2'
cask 'sizeup'
cask 'scenebuilder'
cask 'skype'
cask 'slack'
cask 'vlc'
cask 'vyprvpn'
cask 'docker'

# App Store applications
mas '1Password', id: 443987910
mas 'Double Shot', id: 1076145960
mas 'Monosnap', id: 540348655
mas 'OmniGraffle', id: 1142578753
mas 'Pixelmator', id: 407963104
mas 'SimpleMind', id: 434808346
mas 'Tweetbot', id: 557168941
